task-gt/task-c/openfoam/task-03/init_file/bfs_base/0/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet { type calculated; value uniform 0; }
    outlet { type calculated; value uniform 0; }
    upperWall { type nutkWallFunction; value uniform 0; }
    lowerWall { type nutkWallFunction; value uniform 0; }
    frontAndBack { type empty; }
}
