task-gt/task-c/openfoam/task-03/init_file/bfs_base/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
application     pimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5; // TODO_END_TIME


deltaT          0.001; // TODO_DELTA_T
writeControl    timeStep;
writeInterval   1000;
runTimeModifiable true;
